src/Documents/Акция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Акция</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипАкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыАкций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАкций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СериализованноеРасписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПодарков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеАкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветЦелевыхТоваров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПремиальныеТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Станция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Станции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦелевыеТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Акция/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ПустаяСтрока(НазваниеАкции) Тогда
	
		СформироватьАвтоНазвание();
	
	КонецЕсли; 
	
	Если ТипАкции.Пустая() Тогда
		ТипАкции = ВидАкции.Тип;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(СериализованноеРасписание) Тогда
		Расписание = ЗначениеИзСтрокиВнутр(СериализованноеРасписание);
		РасписаниеСтрокой = Строка(Расписание);
		Если РасписаниеСтрокой = "каждый  день; один раз в день" Тогда
			РасписаниеСтрокой = "Нажмите, чтобы задать расписание";
		Иначе
			РасписаниеСтрокой = СтрЗаменить(РасписаниеСтрокой,"; один раз в день","");
			РасписаниеСтрокой = СтрЗаменить(РасписаниеСтрокой,"один раз в день","");
		КонецЕсли;
		РасписаниеСтрокой = СтрЗаменить(РасписаниеСтрокой,":00:00",":00");

		
	КонецЕсли; 
	
	Автор = ПараметрыСеанса.ТекущийПользователь;
	
	Если ПремиальныеТовары.Количество() Тогда
		Для каждого Т Из ПремиальныеТовары Цикл
			
			Если Т.Количество = 0 Тогда
				Сообщить("Не указано количество по премиальному товару в строке " + т.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
			
			//Если Т.Цена = 0 Тогда
			//	Сообщить("Не указана скидка по премиальному товару в строке " + т.НомерСтроки);
			//	Отказ = Истина;
			//КонецЕсли;
			
		КонецЦикла;
	Иначе
		Сообщить("Не заполнены премиальные товары!");
		Отказ = Истина;
	КонецЕсли; 
	
	Если ТипАкции = Справочники.ТипыАкций.СуммаЗаказа Тогда 
		Если Не ЗначениеЗаполнено(ПороговаяСумма) Тогда
			
			Сообщить("Не указана пороговая сумма");	
			Отказ = Истина;
			
		КонецЕсли; 
	Иначе
		Если ЦелевыеТовары.Количество()=0 Тогда
		
			Сообщить("Не заполнены целевые товары!");
			Отказ = Истина;
		
		КонецЕсли;		
	КонецЕсли; 
	
	АкцияДействует = Документы.Акция.ДействующиеАкции().Найти(Ссылка) <> Неопределено;
	Если ДополнительныеСвойства.Свойство("БезПоверок") = Ложь И Проведен И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если АкцияДействует Тогда
			
			Сообщить("Нельзя снимать акцепт действующей акции.");
			Отказ = Истина;
		
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьАвтоНазвание() Экспорт
	НазваниеАкции = ВидАкции;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	
КонецПроцедуры
